app/views/visitors/index.html.erb

        <div class="intro-heading text-uppercase">subleasing made easy.</div>
        <!-- <p><%= link_to 'Users:', users_path %> <%= User.count %> registered</p> -->
---
SELECT COUNT(*) FROM "users"