app/views/users/show.html.erb

  <div>Edit Listings:
    <% @user.listing_ids.each do |id| %>
---
SELECT "listings"."id" FROM "listings" WHERE "listings"."user_id" = ?  [["user_id", 2]]