app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings" ORDER BY "listings"."price" ASC
---
  def index
    @listings = Listing.all.order(:price)