app/controllers/listings_controller.rb

  def index
    @listings = Listing.all.order("created_at desc")
---
SELECT "listings".* FROM "listings" ORDER BY created_at desc

  def create
    @listing = current_user.listings.build(listing_params)

    respond_to do |format|
      if @listing.save
---
INSERT INTO "listings" ("author", "price", "open_spots", "street", "city", "start_date", "end_date", "rating", "description", "created_at", "updated_at", "lat", "lng", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_listing
      @listing = Listing.find(params[:id])
---
SELECT "listings".* FROM "listings" WHERE (listings.lat IS NOT NULL AND listings.lng IS NOT NULL) AND (listings.lat>-0.0722849264267955 AND listings.lat<0.0722849264267955 AND listings.lng>-0.0722849264267955 AND listings.lng<0.0722849264267955) AND ((