app/controllers/subletters_controller.rb

	def index
	    if params[:search]
	    	@search_term = params[:search]
	    	puts 'Search for date: ', @search_term
	    	@subletters_list = Subletter.all
---
SELECT "subletters".* FROM "subletters"

	def show
		@subletter = Subletter.find(params[:id])
---
SELECT  "subletters".* FROM "subletters" WHERE "subletters"."id" = ? ORDER BY "subletters"."id" ASC LIMIT ?  [["id", 4], ["LIMIT", 1]]